### Creating a database and a table with data from last steps

In [1]:
import pandas as pd
import sqlite3
from sqlalchemy import create_engine

In [2]:
data = pd.read_csv('books.csv')

In [3]:
data.head()

,category,title,price,rate,in_stock,datetime
0,classics,The Secret Garden,15.08,4,5,2022-03-07 22:10:20.994086
1,classics,The Metamorphosis,28.58,1,5,2022-03-07 22:10:21.172272
2,classics,The Pilgrim's Progress,50.26,2,4,2022-03-07 22:10:21.494552
3,classics,The Hound of the Baskervilles (Sherlock Holmes...,14.82,2,4,2022-03-07 22:10:21.676425
4,classics,Little Women (Little Women #1),28.07,4,4,2022-03-07 22:10:21.846924

In [4]:
# table schema
query_books_schema = """

    CREATE TABLE book_shelf(
        category  TEXT, 
        title     TEXT, 
        price     REAL, 
        rate      INTEGER,
        in_stock  INTEGER, 
        datetime  TEXT    
    )
"""

In [5]:
# creation of database and table 'book_shelf'
conn = sqlite3.connect('books_db.sqlite')  # connect to db or create it if doesn't exist
cursor = conn.execute(query_books_schema)  # plan the execution
conn.commit()  # execute: create empty table 'book_shelf'

In [6]:
conn = create_engine('sqlite:///books_db.sqlite', echo=False)  # as I already have a db file, now I use create_engine

In [7]:
# insert data to table
data.to_sql('book_shelf', con=conn, if_exists='append', index=False)

In [8]:
# creation of a dataframe from 'book_shelf' table
query = """
    SELECT * FROM book_shelf
"""
df = pd.read_sql_query(query, conn)

In [9]:
df.head()

,category,title,price,rate,in_stock,datetime
0,classics,The Secret Garden,15.08,4,5,2022-03-07 22:10:20.994086
1,classics,The Metamorphosis,28.58,1,5,2022-03-07 22:10:21.172272
2,classics,The Pilgrim's Progress,50.26,2,4,2022-03-07 22:10:21.494552
3,classics,The Hound of the Baskervilles (Sherlock Holmes...,14.82,2,4,2022-03-07 22:10:21.676425
4,classics,Little Women (Little Women #1),28.07,4,4,2022-03-07 22:10:21.846924